In [1]:
import pandas as pd
import numpy as np

# Example 1

In [38]:
df1=pd.DataFrame({"A":['a','b','a','c','b','c'],"B":[2,6,1,3,3,2],"C":[100,87,96,90,89,92]})

In [4]:
df1

   A  B    C
0  a  2  100
1  b  6   87
2  a  1   96
3  c  3   90
4  b  3   89
5  c  2   92

In [23]:
df1.groupby('A').mean()

     B     C
A
a  1.5  98.0
b  4.5  88.0
c  2.5  91.0

In [21]:
df1.groupby('A').apply(np.mean)

C:\ProgramData\Anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\ProgramData\Anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

     B     C
A
a  1.5  98.0
b  4.5  88.0
c  2.5  91.0

In [10]:
df1.groupby(['A','B']).mean()

         C
A B
a 1   96.0
  2  100.0
b 3   89.0
  6   87.0
c 2   92.0
  3   90.0

分组后进行列计算

In [15]:
df2=df1.groupby('A')

In [16]:
df2.std()

          B         C
A
a  0.707107  2.828427
b  2.121320  1.414214
c  0.707107  1.414214

In [18]:
df2[['B']].std()

          B
A
a  0.707107
b  2.121320
c  0.707107

In [19]:
df2.agg({'B':'std','C':'mean'}) #不同聚合，和hive类似

          B     C
A
a  0.707107  98.0
b  2.121320  88.0
c  0.707107  91.0

In [39]:
df1.groupby('A').agg({'B':[np.mean,'sum'],'C':['count',np.std]})

     B         C
  mean sum count       std
A
a  1.5   3     2  2.828427
b  4.5   9     2  1.414214
c  2.5   5     2  1.414214

# Example 2

In [24]:
np.random.seed(0)

In [26]:
df3=pd.DataFrame({'Age':np.random.randint(20,70,100),
                      'Sex':np.random.choice(['Male','Female'],100),
                      'Books':np.random.randint(1,20,100)})

将age分成两组，有两种方法：

In [34]:
#Method 1
age_group=pd.cut(df3['Age'],bins=4)

#Method 2
# bin2=[19,40,65,np.inf]
# pd.cut(df3['Age'],bins=bin2)

In [35]:
df3.groupby(age_group).mean()

                       Age      Books
Age
(19.951, 32.25]  24.777778   9.851852
(32.25, 44.5]    37.958333  11.291667
(44.5, 56.75]    51.807692   9.807692
(56.75, 69.0]    63.347826  10.956522

In [36]:
pd.crosstab(age_group,df3['Sex']) #count

Sex              Female  Male
Age
(19.951, 32.25]      16    11
(32.25, 44.5]        10    14
(44.5, 56.75]        15    11
(56.75, 69.0]        15     8

transform

In [40]:
df1.groupby('A')['B',"C"].transform('count')

C:\Users\温泉小鱼汤\AppData\Local\Temp\ipykernel_14016\1775091683.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df1.groupby('A')['B',"C"].transform('count')

   B  C
0  2  2
1  2  2
2  2  2
3  2  2
4  2  2
5  2  2